# GetMEPConnectorInfo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..GetMEPConnectorInfo Method
Connector Class See Also
---
Gets MEP connector information.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public MEPConnectorInfo GetMEPConnectorInfo()
```

Visual Basic
---
```text
Public Function GetMEPConnectorInfo As MEPConnectorInfo
```

Visual C++
---
```text
public:
MEPConnectorInfo^ GetMEPConnectorInfo()
```

# ### Return Value
Returns nullNothingnullptra null reference (Nothing in Visual Basic) if there is no MEP connector information associated.
# See Also
Connector Class
Autodesk.Revit.DB Namespace